app/controllers/training_units_controller.rb

SELECT * FROM "training_units"
---
  def index
    @training_units = TrainingUnit.all

SELECT * FROM "training_units" WHERE ("training_units"."id" = 1)
---
  def show
    @training_unit = TrainingUnit.find(params[:id])

SELECT * FROM "training_units" WHERE ("training_units"."id" = 1)
---
  def edit
    @training_unit = TrainingUnit.find(params[:id])

INSERT INTO "training_units" ("begin", "duration_h", "route", "created_at", "updated_at", "duration_m", "tempo", "distance") VALUES('2009-11-21 14:29:00.000000', NULL, E'', '2009-11-21 14:34:42.509872', '2009-11-21 14:34:42.509872', NULL, NULL, 7.9) RETURNING "id"
---
  def create
    @training_unit = TrainingUnit.new(params[:training_unit])

    respond_to do |format|
      if @training_unit.save

SELECT * FROM "training_units" WHERE ("training_units"."id" = 1)
UPDATE "training_units" SET "distance" = 0.0, "updated_at" = '2009-11-21 14:34:51.115210' WHERE "id" = 1
---
  def update
    @training_unit = TrainingUnit.find(params[:id])

    respond_to do |format|
      if @training_unit.update_attributes(params[:training_unit])